Repository: pypi-data/pypi-mirror-352
Catalog: packages/lino-prima/lino_prima-25.6.0-py3-none-any.whl/lino_prima/lib/prima/locale/*/LC_MESSAGES/django.po
Languages: de

source: Certificates
de: Zeugnisse

source: Certificate state
de: Zeugnis-Zustand

source: Certificate states
de: Zeugnis-Zustände

source: Draft
de: Entwurf

source: To discuss
de: Zu besprechen

source: Certificate template
de: Zeugnisvorlage

source: Certificate templates
de: Zeugnisvorlagen

source: Certificate section template
de: Zeugnisabschnittvorlage

source: Certificate section templates
de: Zeugnisabschnittvorlagen

source: Remark
de: Bemerkung

source: Certificate element template
de: Zeugniselementvorlage

source: Certificate element templates
de: Zeugniselementvorlagen

source: Certificate
de: Zeugnis

source: Pupil
de: Schüler

source: Social skills comment
de: Sozialkompetenz-Kommentar

source: Final verdict
de: Versetzungsentscheidung

source: Absences with parental excuse
de: Abwesenheiten mit einer schriftlichen Entschuldigung

source: Absences with medical certificate
de: Abwesenheiten mit einem ärztlichen Attest

source: Unexcused absences
de: Abwesenheiten ohne schriftliche Entschuldigung

source: AbsM
de: AbwA

source: AbsP
de: AbwE

source: AbsU
de: AbwU

source: Certificate section
de: Zeugnisabschnitt

source: Certificate sections
de: Zeugnisabschnitte

source: Override score
de: Bewertung überschreiben

source: Certificate element
de: Zeugniselement

source: Certificate elements
de: Zeugniselemente

source: Computed rating
de: Berechnet

source: Ratings detail
de: Detail Bewertungen

source: Ratings
de: Bewertungen

source: Verdict
de: Entscheidung

source: Academic year
de: Schuljahr

source: Academic years
de: Schuljahre

source: Period
de: Periode

source: Periods
de: Perioden

source: Teacher
de: Lehrer

source: weird
de: seltsam

source: obsolete
de: veraltet

source: great
de: super

source: Class teacher
de: Klassenleiter

source: Catholic religion
de: Katholische Religion

source: Protestant religion
de: Evangelische Religion

source: Music
de: Musik

source: Projects
de: Bausteine

source: Science
de: Wissenschaften

source: Geography
de: Geographie

source: History
de: Geschichte

source: Natural science
de: Naturwissenschaften

source: Art
de: Kunst

source: Painting
de: Malen

source: Textile
de: Textil

source: Choir
de: Chor

source: Flute
de: Flöte

source: Swimming
de: Schwimmen

source: French
de: Französisch

source: Reading
de: Lesen

source: Writing
de: Schreiben

source: Speaking
de: Sprechen

source: Listening
de: Hören

source: Dealing with texts and media
de: Umgang mit Text und Medien

source: Knowledge
de: Wissen

source: Trusting
de: Vertrauen

source: Mathematics
de: Mathematik

source: Arithmetics
de: Arithmetik

source: Stochastics
de: Stochastik

source: German
de: Deutsch

source: Reading comprehension
de: Leseverständnis

source: Presentation
de: Präsentation

source: About animals
de: Über Tiere

source: Reporting
de: Berichten

source: Describing
de: Beschreiben

source: Tell real-life stories
de: Geschichten aus dem Leben

source: This {model} is {adjective}.
de: Diese(r/s) {model} ist {adjective}.

source: Project state
de: Baustein-Status

source: Project states
de: Baustein-Stati

source: {} ({} points)
de: {} ({} Punkte)

source: General rating
de: Allgemeinbewertung

source: General ratings
de: Allgemeinbewertungen

source: Cleanliness
de: Sauberkeit

source: Correction
de: Korrektur

source: Time managment
de: Zeitmanagement

source: Work behaviour
de: Arbeitsverhalten

source: Project template
de: Bausteinvorlage

source: Project templates
de: Bausteinvorlagen

source: Short header
de: Kurzbezeichnung

source: Main skill
de: Hauptkompetenz

source: Project section
de: Bausteinabschnitt

source: Project sections
de: Bausteinabschnitte

source: Project
de: Baustein

source: Started on
de: Begonnen am

source: There are no {projects} configured for grade {grade}.
de: Es seind keine {projects} konfiguriert für {grade}.

source: Predicate
de: Prädikat

source: Predicates
de: Prädikate

# rating predicate
source: Excellent
de: Sehr gut

# rating predicate
source: E
de: SG

# rating predicate
source: Good
de: Gut

# rating predicate
source: Sufficient
de: Ausreichend

# rating predicate
source: S
de: A

# rating predicate
source: Deficient
de: Mangelhaft

# rating predicate
source: D
de: M

# rating predicate
source: Insufficient
de: Ungenügend

# rating predicate
source: I
de: U

source: Rating type
de: Bewertungsart

source: Rating types
de: Bewertungsarten

source: Score
de: Punkte

source: Max. score
de: Max. Punkte

source: Set score value
de: Punkte setzen

source: Rate it
de: Bewerte

source: Done since
de: Fertig seit

source: Ratings done
de: Bewertungen gemacht

source: Total score
de: Summe Punkte

source: Total max score
de: Summe Max.Punkte

source: Final tests
de: Abschlusstests

source: Exam
de: Test

source: Exams
de: Tests

source: Date
de: Datum

source: Period {} must be in {}
de: Startperiode muss in {} liegen

source: Completion
de: Fortschritt

source: Challenge
de: Leistung

source: Challenges
de: Leistungen

source: Section
de: Abschnitt

source: Challenge rating
de: Leistungsbewertung

source: Challenge ratings
de: Leistungsbewertungen

source: for {pupil}
de: für {pupil}

source: Exam response
de: Test-Antwort

source: Exam responses
de: Test-Antworten

source: No {challenges} in {exam}.
de: Keine {challenges} in {exam}.

source: Final exam
de: Abschlusstest

source: Final exams
de: Abschlusstests

source: Final exam rating
de: Abschlusstestbewertung

source: Final exam ratings
de: Abschlusstestbewertungen

source: Rating summary
de: Bewertungsübersicht

source: Rating summaries
de: Bewertungsübersichten

source: Max score
de: Max.Punkte

source: Skills overview
de: Übersicht Kompetenzen

source: Pupil ratings
de: Schülerbewertungen

source: Pupils and ratings
de: Schüler und Bewertungen

source: There are no {challenges} configured for {exam}.
de: Keine {challenges} konfiguriert für {exam}.

source: Ratings by response
de: Bewertungen pro Antwort

source: No data
de: Keine Daten

source: School
de: Schule

source: Grade
de: Jahrgang

source: Grades
de: Jahrgänge

# in school
source: Subject
de: Fach

source: Subjects
de: Fächer

source: Advanced
de: Erweitert

source: Skill
de: Kompetenz

source: Skills
de: Kompetenzen

source: With final exams
de: Mit Abschlusstests

source: Group
de: Klasse

source: Groups
de: Klassen

source: Course
de: Kurs

source: Courses
de: Kurse

source: Role
de: Rolle

source: Roles
de: Rollen

source: Cast
de: Lehrerrolle

source: Casts
de: Lehrerrollen

source: as {role}
de: als {role}

source: {teacher} as
de: {teacher} als

source: Enrolment
de: Einschreibung

source: Enrolments
de: Einschreibungen

source: No course for {subject} in {group}.
de: Keine Kurse für {subject} in {group}.

source: My groups
de: Meine Klassen

source: Contact
de: Kontakt
