Repository: pypi-data/pypi-mirror-352
Catalog: packages/invenio-administration/invenio_administration-4.0.0-py2.py3-none-any.whl/invenio_administration/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: Invalid resource {resource} configured for view {view}.
sv: Ogiltig resurs {resource} konfigurerad för vyn {view}.

source: No extension found with name '{extension_name}' .
sv: Inget tillägg hittades med namnet '{extension_name}' .

source: Invalid actions configuration, order or schema missing
sv: Ogiltig åtgärdskonfiguration, ordning eller schema saknas

source: Cannot instantiate resource view {name} without a resource.
sv: Det går inte att instansiera resursvyn {name} utan en resurs.

source: Cannot instantiate resource view {name} without an associated flask extension.
sv: Det går inte att instansiera resursvyn {name} utan en associerad kolvtillägg.

source: Cannot instantiate administration view {name} without a default GET view
sv: Det går inte att instansiera administrationsvyn {name} utan en standardvy för GET

source: %(icon)s Administration
sv: %(icon)s Administrering

source: Side menu
sv: Sidomenyn

source: Welcome to InvenioRDM Administration
sv: Välkommen till InvenioRDM Administration

source: Welcome to Invenio Administration
sv: Välkommen till Invenio Administration

source: My managment tool
sv: Mitt hanteringsverktyg

source: Back
sv: Tillbaka

source: Create
sv: Skapa

source: Home navigation
sv: Hemnavigering

source: Back to front page
sv: Tillbaka till förstasidan

source: Menu
sv: Meny

source: Close menu
sv: Stäng menyn

source: Administration dashboard
sv: Administrationskontrollpanel

source: Dashboard
sv: Kontrollpanelen

source: Log in
sv: Logga in

source: Sign up
sv: Registrera konto

source: New OAI-PMH set
sv: Nytt OAI-PMH set

source: Actions
sv: Åtgärder

source: My account
sv: Mitt konto

source: Log out
sv: Logga ut

source: Toggle side menu
sv: Växla sidomeny
