Repository: pypi-data/pypi-mirror-352
Catalog: packages/django-eav2/django_eav2-1.8.1-py3-none-any.whl/eav/locale/*/LC_MESSAGES/django.po
Languages: id

source: You cannot change the datatype of an attribute that is already in use.
id: Anda tidak dapat mengubah tipe data atribut yang sudah digunakan.

source: A Comma-Separated-Value field.
id: Bidang Nilai-yang-Dipisahkan-Koma.

source: Enter comma-separated-values. eg: one;two;three.
id: Masukkan nilai-yang-dipisahkan-koma. misalnya: satu;dua;tiga.

source: The %s could not be saved because the datadidn't validate.
id: %s tidak dapat disimpan karena datanya tidak tervalidasi.

source: Value
id: Nilai

source: Name
id: Nama

source: Enum group
id: Grup enum

source: Attribute
id: Atribut

source: Attributes
id: Atribut

source: Text
id: Teks

source: Date
id: Tanggal

source: Float
id: Bilangan desimal

source: Integer
id: Bilangan bulat

source: True / False
id: Benar / Salah

source: Django Object
id: Objek Django

source: Multiple Choice
id: Pilihan Ganda

source: JSON Object
id: Objek JSON

source: Comma-Separated-Value
id: Nilai-yang-Dipisahkan-Koma

source: Data Type
id: Tipe Data

source: User-friendly attribute name
id: Nama atribut yang ramah pengguna

source: Short unique attribute label
id: Label atribut unik yang pendek

source: Required
id: Diperlukan

source: Entity content type
id: Jenis konten entitas

source: Choice Group
id: Grup Pilihan

source: Short description
id: Deskripsi singkat

source: Description
id: Deskripsi

source: Display order
id: Urutan tampilan

source: Modified
id: Dimodifikasi

source: Created
id: Dibuat

source: %(val)s is not a valid choice for %(attr)s
id: %(val)s bukan pilihan yang valid untuk %(attr)s

source: You must set the choice group for multiple choice attributes
id: Anda harus mengatur grup pilihan untuk atribut pilihan ganda

source: You can only assign a choice group to multiple choice attributes
id: Anda hanya dapat menetapkan grup pilihan ke atribut pilihan ganda

source: Values
id: Nilai

source: Entity id
id: id entitas

source: Entity uuid
id: uuid entitas

source: Entity ct
id: Entitas ct

source: Value bool
id: Nilai bool

source: Value CSV
id: Nilai CSV

source: Value date
id: Nilai tanggal

source: Value float
id: Nilai float

source: Value int
id: Nilai int

source: Value text
id: Nilai teks

source: Value JSON
id: Nilai JSON

source: Value enum
id: Nilai enum

source: Generic value id
id: Id nilai generik

source: Generic value content type
id: Jenis konten nilai generik

source: %(obj)s has no EAV attribute named %(attr)s
id: %(obj)s tidak memiliki atribut EAV bernama %(attr)s

source: {} EAV field cannot be blank
id: {} Bidang EAV tidak boleh kosong

source: %(attr)s EAV field %(err)s
id: %(attr)s bidang EAV %(err)s

source: Must be str or unicode
id: Harus berupa str atau unicode

source: Must be a float
id: Harus berupa float

source: Must be an integer
id: Harus berupa integer

source: Must be a date or datetime
id: Harus berupa date atau datetime

source: Must be a boolean
id: Harus berupa boolean

source: Must be a django model object instance
id: Harus berupa instance objek model django

source: Model has not been saved yet
id: Model belum disimpan

source: EnumValue has not been saved yet
id: EnumValue belum disimpan

source: Must be a JSON Serializable object
id: Harus berupa objek JSON yang dapat diserialisasikan

source: Must be Comma-Separated-Value.
id: Harus berupa Nilai-ang-Dipisahkan-Koma.
