from setuptools import setup

setup(
    name="Vol4onok", # Имя модуля, которое будет использоваться при установке через pip install
    version="0.2", # Версия модуля. При каждом обновлении её надо увеличивать
    description="Мои личные инструменты", # Описание проекта, его можно не использовать
    packages=["Vol4onok"], #Список с названиями папок, которые нужно залить
    author_email="akkiravolkov@gmail.com", # Почта атора
    zip_safe = False, # Пароль, можно не указывать
    install_requires = [], # Список дополнительных модулей, которые необходимы для использования вашего модуля
    
)